# GetBackground Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetBackground Method
View Class See Also
---
Returns the current background set for the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ViewDisplayBackground GetBackground()
```

Visual Basic
---
```text
Public Function GetBackground As ViewDisplayBackground
```

Visual C++
---
```text
public:
ViewDisplayBackground^ GetBackground()
```

# ### Return Value
Current background.
# See Also
View Class
Autodesk.Revit.DB Namespace